src/rhoPimpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-1;
deltaT          1e-2;
adaptiveDdt      yes;
// maxCo           10;

writeControl    runTime;

writeInterval   1e-2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    libs            (fieldFunctionObjects);

    Ma
    {
        type            MachNo;
        executeControl  writeTime;
        writeControl    writeTime;
    }
    // {
    //     Ma
    //     {
    //         type            MachNo;
    //         executeControl  timeStep;
    //         writeControl    timeStep;
    //         timeStart       1e-5; // Only after 1e-5
    //     }
    // }

    rhofunc
    {
        type                 writeObjects;
        libs            ("libutilityFunctionObjects.so");
        writeControl        writeTime;
        writeControl       writeTime;
        objects
        ("rho");
    }
}



// ************************************************************************* //
