src/rhoPimpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       760;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          12;
        startFace       780;
    }
    wedge
    {
        type            patch;
        nFaces          8;
        startFace       792;
    }
    top
    {
        type            patch;
        nFaces          20;
        startFace       800;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       820;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       1220;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       1620;
    }
)

// ************************************************************************* //
