src/rhoPimpleFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default 	     cellLimited<cubic> 1.5 Gauss linear 1;
}

divSchemes
{
    // default         Gauss bounded;//none;
    div(phi,U)      Gauss upwind corrected;
    div(phid,p)     Gauss upwind;
    div(phid,U)     Gauss upwind;
    div(phi,e)      Gauss upwind;
    div(phi,K)      Gauss upwind;
    div(phiv,p)     Gauss upwind;
    // Add for rhoCentralFoam
    div(tauMC)     Gauss linear;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
