src/rhoPimpleFoam/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "p"
    {
        solver      PBiCGStab;
        // smoother    GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          1e-4;//0.01;
        minIter         2;
    }
    "pFinal"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          1e-4;//0.01;
        minIter         2;
    }
    
    // "(U|e)"
    "(U|e|UFinal|eFinal)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          1e-4;
    }
    // "(UFinal|eFinal)"
    //     {
    //         solver          GAMG;
    //         smoother        GaussSeidel;
    //         tolerance       1e-06;
    //         relTol          1e-4;//0.01;
    //     }
    

    "(rho|rhoFinal)"
    {
        solver          PCG;
        preconditioner
        {
            type      AMG;
        }
        tolerance       1e-4;
        relTol          1e-4;
    }
}

PIMPLE
{
    momentumPredictor       yes;
    consistent              no;//yes;
    nOuterCorrectors        2;
    nCorrectors             3;
    nNonOrthogonalCorrectors 2;
    transonic               yes;
    maxCo                   1000;//0.5;
    rDeltaTSmoothingCoeff   0.1;
    rDeltaTDampingCoeff     0.5;
    maxDeltaT               0.1;//0.001;
}

relaxationFactors
{
    fields
    {
        p   0.3;
        rho 0.5;
    }
    equations
    {
        U                   0.7;
        e                   0.5;
        "(k|epsilon|omega)" 0.5;
    }
}
// relaxationFactors
// {
//     fields
//     {
//         p   0.1;
//     }
//     equations
//     {
//         U                   0.7;
//         e                   0.1;
//         "(k|epsilon|omega)" 0.1;
//     }
// }

