src/rhoPimpleFoam/system/fvOptions
limitTemperature
{
    type limitTemperature;
    active true;
    limitTemperatureCoeffs
    {
        selectionMode all;
        Tmin 200;
        Tmax 400;
    }
} 