src/rhoPimpleFoam/system/surfaceFeatureExtractDict
// system/surfaceFeatureExtractDict

geometry
{
    domain
    {
        type triSurfaceMesh;
        file "domain.stl";  // Make sure this path is correct
    }
}

extractFromGeometry
{
    method edge;
}

refinementRegions
{
    wedge
    {
        mode inside;
        levels (5 6);
    }
}

